<?php
return array(
    'SPORT' => array(
        'N' => '沒有結果',
        'C' => '註銷',
        'W' => '贏',
        'L' => '輸',
        'LW'    => '贏一半',
        'LL'    => '輸一半',
        '0'     => '平手',
        'D'     => '未接受',
        'F'     => '非法下注註銷',
        'X'     => '未結算',
        'S'     => '等待中'
    ),
   "LIVE"   => array(
       '-1' =>  '註銷',
       '0'  =>  '未結算',
       ''   => '已结算',
   ),
   "DIANZI" => array(
       '-1' => '註銷',
       '1'  => '贏',
       '200'    => '輸',
       '0'      => '未結算',
       '-77'    =>  '未結算',
   ),
    'LOTTERY'    => array(
        'W'  => '贏',
        'L'  => '輸',
        'N'  =>  '平手',
        '0'  => '沒有結果',
        'N2' => '註銷',
    )
);