<?php
namespace tests;
class SYXWTest extends TestCase
{
		 public function testGfwf(){
			 require_once('./swoole/parse-calc-count.php');

																		/*  11选5  */
			//任选一
			//测试成功用例：(1) 投注号码 02 ; 开奖号码 02,05,06,08,09 ; (2) 投注号码 09 05 01; 开奖号码 04,05,06,08,11 ;(3) 投注号码 05 09 04 11 ; 开奖号码 05,06,07,08,10 ;
			//测试失败用例：(1) 投注号码 02 ; 开奖号码 03,05,06,08,09 ; (2) 投注号码 04 10 02; 开奖号码 01,05,06,08,11 ;(3) 投注号码 11 09 04 03 ; 开奖号码 02,06,07,08,10 ;
			$ret = gd11x5R1("02","02,05,06,08,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R1("09 05 01","04,05,06,08,11");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R1("05 09 04 11","05,06,07,08,10");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5R1("02","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R1("04 10 02","01,05,06,08,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R1("11 09 04 03","02,06,07,08,10");
			$this->assertEquals($ret, 0);
			
			//任选二
			//测试成功用例：(1) 投注号码 02 04; 开奖号码 02,05,04,08,10 ; (2) 投注号码 04 05 08; 开奖号码 04,05,06,08,11 ;(3) 投注号码 	(02)04 10 ; 开奖号码 02,06,07,08,10 ;
			//测试失败用例：(1) 投注号码 02 05; 开奖号码 03,05,06,08,09 ; (2) 投注号码 04 05 08; 开奖号码 01,05,06,09,11 ;(3) 投注号码 	(02)04 10 ; 开奖号码 08,05,07,06,01 ;

			$ret = gd11x5R2("02 04","02,05,04,08,10");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R2("04 05 08","04,05,06,08,11");
			$this->assertEquals($ret, 3);
			$ret = gd11x5R2("(02)04 10","02,06,07,08,10");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5R2("02 05","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R2("04 05 08","01,05,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R2("(02)04 10","08,05,07,06,01");
			$this->assertEquals($ret, 0);
			
			//任选三
			//测试成功用例：(1) 投注号码 02 04 06; 开奖号码 02,05,04,06,10 ; (2) 投注号码 03 06 07 08 11; 开奖号码 03 06 07 08 11 ;(3) 投注号码 (02)03 04 ; 开奖号码 02,06,03,08,04 ;
			//测试失败用例：(1) 投注号码 02 04 06; 开奖号码 03,05,06,08,09 ; (2) 投注号码 03 06 07 08 11; 开奖号码 01,05,06,09,11 ;(3) 投注号码 (02)04 10 ; 开奖号码 08,05,07,06,01 ;
			$ret = gd11x5R3("02 04 06","02,05,04,06,10");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R3("03 06 07 08 11","03 06 07 08 11");
			$this->assertEquals($ret, 10);
			$ret = gd11x5R3("(02)03 04","02,06,03,08,04");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5R3("02 04 06","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R3("03 06 07 08 11","01,05,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R3("(02)04 10","08,05,07,06,01");
			$this->assertEquals($ret, 0);
			

			//任选四
			//测试成功用例：(1) 投注号码 01 03 06 07; 开奖号码 01,03,06,07,10; (2) 投注号码 01 03 05 06 08; 开奖号码 03,06,05,08,11 ;(3) 投注号码 (04)03 06 07 ; 开奖号码 07,06,03,08,04 ;
			//测试失败用例：(1) 投注号码 01 03 06 07; 开奖号码 03,05,06,08,09; (2) 投注号码 01 03 05 06 08; 开奖号码 01,05,06,09,11 ;(3) 投注号码 (04)03 06 07 ; 开奖号码 08,05,07,06,01 ;
			$ret = gd11x5R4("01 03 06 07","01,03,06,07,10");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R4("01 03 05 06 08","03,06,05,08,11");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R4("(04)03 06 07","07,06,03,08,04");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5R4("01 03 06 07","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret =gd11x5R4("01 03 05 06 08","01,05,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R4("(04)03 06 07","08,05,07,06,01");
			$this->assertEquals($ret, 0);
			

			//任选五
			//测试成功用例：(1) 投注号码 03 04 05 07 08; 开奖号码 08,05,04,07,03; (2) 投注号码 (02 04)06 07 08; 开奖号码 02,06,04,08,07 ;(3) 投注号码(03 04 05 08)06 09 ; 开奖号码 06,08,03,05,04 ;
			//测试失败用例：(1) 投注号码 03 04 05 07 08; 开奖号码 03,05,06,08,09; (2) 投注号码 (02 04)06 07 08; 开奖号码 02,04,06,09,11 ;(3) 投注号码(03 04 05 08)06 09 ; 开奖号码 03,05,08,06,09 ;
			$ret = gd11x5R5("03 04 05 07 08","08,05,04,07,03");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R5("(02 04)06 07 08","02,06,04,08,07");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R5("(03 04 05 08)06 09","06,08,03,05,04");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5R5("03 04 05 07 08","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R5("(02 04)06 07 08","02,04,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R5("(03 04 05 08)06 09","03,05,08,06,09");
			$this->assertEquals($ret, 0);
			

			//任选六
			//测试成功用例：(1) 投注号码03 04 05 06 07 08;开奖号码 08,05,04,07,03;(2) 投注号码 (03 04 07 08 10)06; 开奖号码 03,07,10,08,04 ;(3) 投注号码(03 04 07 08 10)06 09 ; 开奖号码 03,04,08,07,10;
			//测试失败用例：(1) 投注号码03 04 05 07 08 06;开奖号码 03,05,06,08,09;(2)投注号码(03 04 07 08 10)06; 开奖号码 02,04,06,09,11 ;(3) 投注号码(03 04 07 08 10)06 09 ; 开奖号码 03,04,07,08,09 ;
			$ret = gd11x5R6("03 04 05 06 07 08","08,05,04,07,03");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R6("(03 04 07 08 10)06","03,07,10,08,04");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R6("(03 04 07 08 10)06 09","03,04,08,07,10");
			$this->assertEquals($ret, 2);
			//失败案例
			$ret = gd11x5R6("03 04 05 07 08 06","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R6("(03 04 07 08 10)06","02,04,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R6("(03 04 07 08 10)06 02","03,04,07,08,09");
			$this->assertEquals($ret, 0);
			

			//任选七
			//测试成功用例：(1) 投注号码02 04 05 07 08 10 11;开奖号码 08,05,04,07,02;(2) 投注号码 (02 04 05 06 09 10)07; 开奖号码 02,05,06,10,04 ;(3) 投注号码(02 03 04 05 06)08 09 ; 开奖号码 03,02,04,05,09;
			//测试失败用例：(1) 投注号码02 04 05 07 08 10 11;开奖号码 03,05,06,08,09;(2)投注号码(02 04 05 06 09 10)07; 开奖号码 02,04,06,09,11 ;(3) 投注号码(02 03 04 05 06)08 09; 开奖号码 03,04,07,08,10 ;
			$ret = gd11x5R7("02 04 05 07 08 10 11","08,05,04,07,02");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R7("(02 04 05 06 09 10)07","02,05,06,10,04");
			$this->assertEquals($ret, 1);
			$ret = gd11x5R7("(02 03 04 05 06)08 09","03,02,04,05,09");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5R7("02 04 05 07 08 10 11","03,05,06,08,09");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R7("(03 04 07 08 10)06","02,04,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R7("(03 04 07 08 05)06 09","03,04,07,08,10");
			$this->assertEquals($ret, 0);
			

			//任选八
			//测试成功用例：(1) 投注号码01 02 03 04 06 08 09 10 11;开奖号码 08,06,04,02,03;(2) 投注号码 01 02 05 04 06 08 07 10 11; 开奖号码 11,07,10,08,04 ;(3) 投注号码01 02 05 04 06 09 07 10 11 ; 开奖号码 01,02,05,07,10;
			//测试失败用例：(1) 投注号码01 02 03 04 06 08 09 10 11;开奖号码 03,05,06,08,07;(2)投注号码 01 02 05 04 06 08 07 10 11; 开奖号码 02,04,06,09,11 ;(3) 投注号码01 02 05 04 06 09 07 10 11; 开奖号码 03,04,07,08,09 ;
			$ret = gd11x5R8("01 02 03 04 06 08 09 10 11","08,06,04,02,03");
			$this->assertEquals($ret, 4);
			$ret = gd11x5R8("01 02 05 04 06 08 07 10 11","11,07,10,08,04");
			$this->assertEquals($ret, 4);	
			$ret = gd11x5R8("01 02 05 04 06 09 07 10 11 ","01,02,05,07,10");
			$this->assertEquals($ret, 10);
			//失败案例
			$ret = gd11x5R8("01 02 03 04 06 08 09 10 11","03,05,06,08,07");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R8("01 02 05 04 06 08 07 10 11","02,04,06,09,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5R8("01 02 05 04 06 09 07 10 11","03,04,07,08,09");
			$this->assertEquals($ret, 0);
			

			//前二直选
			//测试成功用例：(1) 投注号码03,06;开奖号码 03,06,04,02,09; (2)投注号码04 06,07; 开奖号码 04,07,10,08,09 ;(3) 投注号码03 05,04 07; 开奖号码 03,04,05,07,10;
			//测试失败用例：(1) 投注号码03,06;开奖号码 03,05,06,08,07; (2)投注号码04 06,07; 开奖号码 04,06,08,07,11 ;(3) 投注号码03 05,04 07; 开奖号码 03,05,04,07,09 ;
			$ret = gd11x5Q2("03,06","03,06,04,02,09");
		
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q2("04 06,07","04,07,10,08,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q2("03 05,04 07","03,04,05,07,10");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5Q2("03,06","03,05,06,08,07");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q2("04 06,07","04,06,08,07,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q2("03 05,04 07","03,05,04,07,09");
			$this->assertEquals($ret, 0);
			

			//前二组选
			//测试成功用例：(1) 投注号码02 04;开奖号码 02,04,06,07,09; (2)投注号码(04)05 06; 开奖号码 04,06,10,08,09 ;(3) 投注号码02 04 06; 开奖号码 02,04,05,07,10;
			//测试失败用例：(1) 投注号码02 04;开奖号码 02,05,04,08,07; (2)投注号码(04)05 06; 开奖号码 04,07,05,06,11 ;(3) 投注号码02 04 06; 开奖号码 03,05,04,07,09 ;
			$ret = gd11x5Q2z("02 04","02,04,06,07,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q2z("(04)05 06","04,06,10,08,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q2z("02 04 06","02,04,05,07,10");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5Q2z("02 04","02,05,04,08,07");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q2z("(04)05 06","04,07,05,06,11");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q2z("02 04 06","03,05,04,07,09");
			$this->assertEquals($ret, 0);
			

			//前三直选
			//测试成功用例：(1) 投注号码02,03,05;开奖号码 02,03,05,07,09; (2)投注号码02 06,04 08,05; 开奖号码 02,08,05,10,09 ;(3) 投注号码04,03 10,06; 开奖号码 04,10,06,07,11;
			//测试失败用例：(1) 投注号码02,03,05;开奖号码 02,05,03,08,07; (2)投注号码02 06,04 08,05; 开奖号码 02,06,04,08,05 ;(3) 投注号码04,03 10,06; 开奖号码 03,05,04,07,09;
			$ret = gd11x5Q3("02,03,05","02,03,05,07,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q3("02 06,04 08,05","02,08,05,10,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q3("04,03 10,06","04,10,06,07,11");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5Q3("02,03,05","02,05,03,08,07");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q3("02 06,04 08,05","02,06,04,08,05");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q3("04,03 10,06","03,05,04,07,09");
			$this->assertEquals($ret, 0);
			

			//前三组选
			//测试成功用例：(1) 投注号码02 03 04 06;开奖号码 03,04,06,07,09; (2)投注号码(03)04 06; 开奖号码 03,04,06,10,09 ;(3) 投注号码(03)01 06 07; 开奖号码 03,06,07,01,11;
			//测试失败用例：(1) 投注号码02 03 04 06;开奖号码 02,05,03,06,07; (2)投注号码(03)04 06; 开奖号码 02,06,04,03,05 ;(3) 投注号码(03)01 06 07; 开奖号码 03,05,06,01,09;
			$ret = gd11x5Q3z("02 03 04 06","03,04,06,07,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q3z("(03)04 06","03,04,06,10,09");
			$this->assertEquals($ret, 1);
			$ret = gd11x5Q3z("(03)01 06 07","03,06,07,01,11");
			$this->assertEquals($ret, 1);
			//失败案例
			$ret = gd11x5Q3z("02 03 04 06","02,05,03,06,07");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q3z("(03)04 06","02,06,04,03,05");
			$this->assertEquals($ret, 0);
			$ret = gd11x5Q3z("(03)01 06 07","03,05,06,01,09");
			$this->assertEquals($ret, 0);
			
		}

		
}
?>